# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8s
# Parameters
nc: 80  # number of classes
scales:[0.33, 0.50, 1024]  # rgc-yolo

# YOLOv8s.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, RGCSPELAN, [128, 0.5]]
  - [-1, 1, ADown, [512]]
  - [-1, 6, RGCSPELAN, [256, 0.5]]
  - [-1, 1, ADown, [512]]
  - [-1, 6, RGCSPELAN, [512, 1]]
  - [-1, 1, ADown, [1024]]
  - [-1, 3, RGCSPELAN, [1024, 0.5]]
  - [-1, 1, AIFI, [1024, 8]] # 10

# YOLOv8s.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, RGCSPELAN, [512, 0.5]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, RGCSPELAN, [512, 0.5]]  # 15 (P3/8-small)

  - [-1, 1, ADown, [256]]
  - [-1, 1, CAA, []]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, RGCSPELAN, [512, 1]]  # 18 (P4/16-medium)

  - [-1, 1, ADown, [512]]
  - [-1, 1, CAA, []]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, RGCSPELAN, [512, 0.5]]  # 21 (P5/32-large)

  - [[15, 19, 23], 1, Detect_TADDH, [nc, 512]]  # Detect(P3, P4, P5)